app/views/admin/statistic/index.html.erb

SELECT COUNT(*) AS count_all, `books`.`author_id` AS books_author_id FROM `books` GROUP BY `books`.`author_id`
SELECT `authors`.* FROM `authors` WHERE 1=0
---
<script type="text/javascript" src="https://www.gstatic.com/charts/loader.js"></script>
<%= pie_chart Book.group(:author).count %>