app/controllers/admin/author_controller.rb

SELECT  `authors`.`id`, `authors`.`name`, `authors`.`describe` FROM `authors` LIMIT 10 OFFSET 0
---
  def index
    @authors = Author.select(:id, :name, :describe)
      .page(params[:page]).per Settings.constant.page_size

INSERT INTO `authors` (`name`, `describe`, `created_at`, `updated_at`) VALUES ('Duong Tuan Nhat', 'De test thoi', '2018-11-10 08:05:50', '2018-11-10 08:05:50')
---
  def create
    @author = Author.new author_param
    if @author.save

UPDATE `authors` SET `name` = 'Ha Duc Quang', `updated_at` = '2018-11-10 08:06:15' WHERE `authors`.`id` = 2
---
  def update
    if @author.update author_param

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 2 LIMIT 1
---
  def load_author
    @author = Author.find_by id: params[:id]