app/controllers/admin/books_controller.rb

SELECT  DISTINCT `books`.* FROM `books` LIMIT 10 OFFSET 0
SELECT COUNT(DISTINCT `books`.`id`) FROM `books`
---
  def index
    @q = Book.ransack params[:q]
    respond_to do |format|
      format.html do
        @books = @q.result.distinct.page(params[:page])
          .per Settings.constant.page_size

INSERT INTO `books` (`name`, `describe`, `page_number`, `category_id`, `author_id`, `publisher_id`, `created_at`, `updated_at`) VALUES ('Clean code', 'for code clean', 200, 1, 1, 2, '2018-11-10 09:24:03', '2018-11-10 09:24:03')
---
  def create
    @book = Book.new book_param
    if @book.save

UPDATE `books` SET `name` = 'Clean code', `describe` = 'code clean', `page_number` = 211, `author_id` = 1, `category_id` = 2, `publisher_id` = 1, `updated_at` = '2018-11-10 09:34:14' WHERE `books`.`id` = 1
---
  def update
    if @book.update book_param