app/controllers/admin/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`parent_id` IN (1, 2, 8, 9, 10, 11)
---
  def index
    @categories = Category.parent_only
      .includes(:subcategories).show_only
      .page(params[:page]).per Settings.constant.page_size

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('asd', '2018-11-10 07:11:54', '2018-11-10 07:11:54')
---
  def create
    @category = Category.new category_params
    if @category.save

UPDATE `categories` SET `parent` = 1, `updated_at` = '2018-11-10 07:08:17' WHERE `categories`.`id` = 2
---
  def update
    if @category.update category_params

DELETE FROM `categories` WHERE `categories`.`id` = 9
---
  def destroy
    @category.books.update category_id: nil
    if @category.delete