app/controllers/admin/publisher_controller.rb

SELECT  `publishers`.`id`, `publishers`.`name` FROM `publishers` LIMIT 10 OFFSET 0
---
  def index
    @publishers = Publisher.select(:id, :name)
      .page(params[:page]).per Settings.constant.page_size

INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('Horror', '2018-11-08 06:48:08', '2018-11-08 06:48:08')
---
  def create
    @publisher = Publisher.new name: params[:name]
    if @publisher.save

UPDATE `publishers` SET `name` = '1234567', `updated_at` = '2018-11-08 09:08:57' WHERE `publishers`.`id` = 6
---
  def update
    if @publisher.update name: params[:name]

UPDATE `books` SET `publisher_id` = NULL, `updated_at` = '2018-11-09 01:39:15' WHERE `books`.`id` = 1
DELETE FROM `publishers` WHERE `publishers`.`id` = 1
---
  def destroy
    @publisher.books.update publisher_id: nil
    if @publisher.delete

SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 6 LIMIT 1
---
  def load_publisher
    @publisher = Publisher.find_by id: params[:id]