app/controllers/admin/users_controller.rb

SELECT DISTINCT `users`.* FROM `users`
SELECT  DISTINCT `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(DISTINCT `users`.`id`) FROM `users`
---
  def index
    @q = User.ransack params[:q]
    respond_to do |format|
      format.html
      format.js
      format.csv do
        @users = @q.result.distinct
        disposition = "filename=User-#{Time.now.strftime("%m-%d-%Y")}.csv"
        send_data  User.to_csv(@users),
          type: "text/csv; charset=iso-8859-1; header=present",
          disposition: disposition
      end
    end
    @users = @q.result.distinct.page(params[:page])
      .per Settings.constant.page_size

UPDATE `users` SET `username` = 'Bambi Nikolaus1', `updated_at` = '2018-11-08 01:38:22' WHERE `users`.`id` = 16
---
  def update
    if @user.update user_params

DELETE FROM `users` WHERE `users`.`id` = 1
SELECT  DISTINCT `users`.* FROM `users` LIMIT 10 OFFSET 0
---
  def destroy
    if @user.delete
      flash[:success] = t "admin.delete_success"
    else
      flash[:error] = t "admin.can_not_delete"
    end
    @q = User.ransack params[:q]
    @users = @q.result.distinct.page(params[:page])
      .per Settings.constant.page_size

UPDATE `users` SET `is_admin` = 1, `updated_at` = '2018-11-08 08:16:04' WHERE `users`.`id` = 1
SELECT  DISTINCT `users`.* FROM `users` LIMIT 10 OFFSET 0
---
  def update_role
    @user.is_admin = !@user.is_admin
    @user.save
    @q = User.ransack params[:q]
    @users = @q.result.distinct.page(params[:page])
      .per Settings.constant.page_size