app/views/admin/categories/_subcategory.html.erb

SELECT `categories`.* FROM `categories`
---
        locals: {subcategories: sub.subcategories} if
          sub.subcategories.present? %>