app/views/admin/categories/index.html.erb

SELECT `categories`.* FROM `categories` WHERE `categories`.`category_id` IN (1, 2)
---
                  class: "btn btn-primary btn-xs" %>
                <%= link_to t("admin.delete", admin_category_path(category),
                  method: "delete", class: "btn btn-danger btn-xs",
                  data: { confirm: t("admin.delete_confirm") } %>
                <%= render partial: "subcategory",
                  locals: {subcategories: category.subcategories} if
                    category.subcategories.present? %>
              </li>
            <% end %>
          </ul>
        <% end %>
      </div>
      <div class="panel-body">
        <%= paginate @categories %>
      </div>
    </div>
  </div>
</div>
